export default {
	state: {
		jobs: [
		{
			id: 1,
			title: 'Помощник повара',
			publish: '1 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			content: '<p>Додо Пицца - сеть пиццерий № 1 в России.</p><p>В Калининграде имеет 3 пиццерии: на Горького 104б, Дзержинского, 57б, Советский пр,1 (круглосуточная).</p><p>Требования: четкое выполнение стандартов компании. </p><p>Обязанности: работа с тестом, заготовки, упаковка, уборка рабочего места.</p><br><p>Условия:</p><ul><li>официальное устройство (иностранных граждан тоже берем)</li><li>выплаты ЗП 2 раза в месяц</li><li>бесплатные обеды</li><li>бесплатное обучение</li><li>возможность стать менеджером, замом управляющего и управляющим</li><li>дружная команда</li><li>поощрения лучших сотрудников</li><li>униформа предоставляется</li><li>ночной развоз сотрудников</li><li>оплачиваемая медицинская книжка</li></ul><p>ЗП от 25 000 до 40 000</p><p>Оплата с 1 дня работы, даже стажерских часов</p>',
			types: ['Медицина'],
			shedule: 'Частичная',
			city: 'Багратионовск',
			organization: 'ООО Новые Технологии',
			price: '18000',
			contacts: 'Виктория Пшеничникова',
			adress: 'Московский район, ул. Мира, д.89, офис 4',
			phone: '+79991931303'
		},
		{
			id: 2,
			title: 'Научный сотрудник',
			publish: '2 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			content: '<p>Додо Пицца - сеть пиццерий № 1 в России.</p><p>В Калининграде имеет 3 пиццерии: на Горького 104б, Дзержинского, 57б, Советский пр,1 (круглосуточная).</p><p>Требования: четкое выполнение стандартов компании. </p><p>Обязанности: работа с тестом, заготовки, упаковка, уборка рабочего места.</p><br><p>Условия:</p><ul><li>официальное устройство (иностранных граждан тоже берем)</li><li>выплаты ЗП 2 раза в месяц</li><li>бесплатные обеды</li><li>бесплатное обучение</li><li>возможность стать менеджером, замом управляющего и управляющим</li><li>дружная команда</li><li>поощрения лучших сотрудников</li><li>униформа предоставляется</li><li>ночной развоз сотрудников</li><li>оплачиваемая медицинская книжка</li></ul><p>ЗП от 25 000 до 40 000</p><p>Оплата с 1 дня работы, даже стажерских часов</p>',
			types: ['Наука'],
			shedule: 'Полная',
			city: 'Калининград',
			organization: 'ООО Новые Технологии',
			price: '15000',
			contacts: 'Виктория Пшеничникова',
			adress: 'Московский район, ул. Мира, д.89, офис 4',
			phone: '+79991931303'
		},
		{
			id: 3,
			title: 'Репетитор английского языка',
			publish: '3 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			content: '<p>Додо Пицца - сеть пиццерий № 1 в России.</p><p>В Калининграде имеет 3 пиццерии: на Горького 104б, Дзержинского, 57б, Советский пр,1 (круглосуточная).</p><p>Требования: четкое выполнение стандартов компании. </p><p>Обязанности: работа с тестом, заготовки, упаковка, уборка рабочего места.</p><br><p>Условия:</p><ul><li>официальное устройство (иностранных граждан тоже берем)</li><li>выплаты ЗП 2 раза в месяц</li><li>бесплатные обеды</li><li>бесплатное обучение</li><li>возможность стать менеджером, замом управляющего и управляющим</li><li>дружная команда</li><li>поощрения лучших сотрудников</li><li>униформа предоставляется</li><li>ночной развоз сотрудников</li><li>оплачиваемая медицинская книжка</li></ul><p>ЗП от 25 000 до 40 000</p><p>Оплата с 1 дня работы, даже стажерских часов</p>',
			types: ['Образование'],
			shedule: 'Частичная',
			city: 'Гусев',
			organization: 'ООО Новые Технологии',
			price: '28000',
			contacts: 'Виктория Пшеничникова',
			adress: 'Московский район, ул. Мира, д.89, офис 4',
			phone: '+79991931303'
		},
		{
			id: 4,
			title: 'Программист C++',
			publish: '4 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			content: '<p>Додо Пицца - сеть пиццерий № 1 в России.</p><p>В Калининграде имеет 3 пиццерии: на Горького 104б, Дзержинского, 57б, Советский пр,1 (круглосуточная).</p><p>Требования: четкое выполнение стандартов компании. </p><p>Обязанности: работа с тестом, заготовки, упаковка, уборка рабочего места.</p><br><p>Условия:</p><ul><li>официальное устройство (иностранных граждан тоже берем)</li><li>выплаты ЗП 2 раза в месяц</li><li>бесплатные обеды</li><li>бесплатное обучение</li><li>возможность стать менеджером, замом управляющего и управляющим</li><li>дружная команда</li><li>поощрения лучших сотрудников</li><li>униформа предоставляется</li><li>ночной развоз сотрудников</li><li>оплачиваемая медицинская книжка</li></ul><p>ЗП от 25 000 до 40 000</p><p>Оплата с 1 дня работы, даже стажерских часов</p>',
			types: ['IT'],
			shedule: 'Полная',
			city: 'Светлый',
			organization: 'ООО Новые Технологии',
			price: '35000',
			contacts: 'Виктория Пшеничникова',
			adress: 'Московский район, ул. Мира, д.89, офис 4',
			phone: '+79991931303'
		},
		{
			id: 5,
			title: 'Мотоциклист мотоциклов',
			publish: '5 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			content: '<p>Додо Пицца - сеть пиццерий № 1 в России.</p><p>В Калининграде имеет 3 пиццерии: на Горького 104б, Дзержинского, 57б, Советский пр,1 (круглосуточная).</p><p>Требования: четкое выполнение стандартов компании. </p><p>Обязанности: работа с тестом, заготовки, упаковка, уборка рабочего места.</p><br><p>Условия:</p><ul><li>официальное устройство (иностранных граждан тоже берем)</li><li>выплаты ЗП 2 раза в месяц</li><li>бесплатные обеды</li><li>бесплатное обучение</li><li>возможность стать менеджером, замом управляющего и управляющим</li><li>дружная команда</li><li>поощрения лучших сотрудников</li><li>униформа предоставляется</li><li>ночной развоз сотрудников</li><li>оплачиваемая медицинская книжка</li></ul><p>ЗП от 25 000 до 40 000</p><p>Оплата с 1 дня работы, даже стажерских часов</p>',
			types: ['Маркетинг'],
			shedule: 'Стажировка',
			city: 'Балтийск',
			organization: 'ООО Новые Технологии',
			price: 'хз',
			contacts: 'Виктория Пшеничникова',
			adress: 'Московский район, ул. Мира, д.89, офис 4',
			phone: '+79991931303'
		},
		{
			id: 6,
			title: 'Директор банка',
			publish: '6 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			content: '<p>Додо Пицца - сеть пиццерий № 1 в России.</p><p>В Калининграде имеет 3 пиццерии: на Горького 104б, Дзержинского, 57б, Советский пр,1 (круглосуточная).</p><p>Требования: четкое выполнение стандартов компании. </p><p>Обязанности: работа с тестом, заготовки, упаковка, уборка рабочего места.</p><br><p>Условия:</p><ul><li>официальное устройство (иностранных граждан тоже берем)</li><li>выплаты ЗП 2 раза в месяц</li><li>бесплатные обеды</li><li>бесплатное обучение</li><li>возможность стать менеджером, замом управляющего и управляющим</li><li>дружная команда</li><li>поощрения лучших сотрудников</li><li>униформа предоставляется</li><li>ночной развоз сотрудников</li><li>оплачиваемая медицинская книжка</li></ul><p>ЗП от 25 000 до 40 000</p><p>Оплата с 1 дня работы, даже стажерских часов</p>',
			types: ['Финансы'],
			shedule: 'Полная',
			city: 'Нестеров',
			organization: 'ООО Новые Технологии',
			price: '10000',
			contacts: 'Виктория Пшеничникова',
			adress: 'Московский район, ул. Мира, д.89, офис 4',
			phone: '+79991931303'
		},
		{
			id: 7,
			title: 'Бекенд-разработчик',
			publish: '7 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			content: '<p>Додо Пицца - сеть пиццерий № 1 в России.</p><p>В Калининграде имеет 3 пиццерии: на Горького 104б, Дзержинского, 57б, Советский пр,1 (круглосуточная).</p><p>Требования: четкое выполнение стандартов компании. </p><p>Обязанности: работа с тестом, заготовки, упаковка, уборка рабочего места.</p><br><p>Условия:</p><ul><li>официальное устройство (иностранных граждан тоже берем)</li><li>выплаты ЗП 2 раза в месяц</li><li>бесплатные обеды</li><li>бесплатное обучение</li><li>возможность стать менеджером, замом управляющего и управляющим</li><li>дружная команда</li><li>поощрения лучших сотрудников</li><li>униформа предоставляется</li><li>ночной развоз сотрудников</li><li>оплачиваемая медицинская книжка</li></ul><p>ЗП от 25 000 до 40 000</p><p>Оплата с 1 дня работы, даже стажерских часов</p>',
			types: ['IT'],
			shedule: 'Частичная',
			city: 'Калининград',
			organization: 'ООО Новые Технологии',
			price: '10000',
			contacts: 'Виктория Пшеничникова',
			adress: 'Московский район, ул. Мира, д.89, офис 4',
			phone: '+79991931303'
		},
		{
			id: 8,
			title: 'Автослесарь',
			publish: '8 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			content: '<p>Додо Пицца - сеть пиццерий № 1 в России.</p><p>В Калининграде имеет 3 пиццерии: на Горького 104б, Дзержинского, 57б, Советский пр,1 (круглосуточная).</p><p>Требования: четкое выполнение стандартов компании. </p><p>Обязанности: работа с тестом, заготовки, упаковка, уборка рабочего места.</p><br><p>Условия:</p><ul><li>официальное устройство (иностранных граждан тоже берем)</li><li>выплаты ЗП 2 раза в месяц</li><li>бесплатные обеды</li><li>бесплатное обучение</li><li>возможность стать менеджером, замом управляющего и управляющим</li><li>дружная команда</li><li>поощрения лучших сотрудников</li><li>униформа предоставляется</li><li>ночной развоз сотрудников</li><li>оплачиваемая медицинская книжка</li></ul><p>ЗП от 25 000 до 40 000</p><p>Оплата с 1 дня работы, даже стажерских часов</p>',
			types: ['Сервис'],
			shedule: 'Частичная',
			city: 'Гусев',
			organization: 'ООО Новые Технологии',
			price: '145000',
			contacts: 'Виктория Пшеничникова',
			adress: 'Московский район, ул. Мира, д.89, офис 4',
			phone: '+79991931303'
		}
		]
	},
	mutations: {

	},
	actions: {

	},
	getters: {
		jobs (state) {
			return state.jobs
		},
		jobById (state) {
			return jobId => {
				return state.jobs.find(job => job.id === +jobId)
			}
		}
	}
}
