export default {
	state: {
		resumes: [
		{
			id: 1,
			name: 'Алевтина',
			surname: 'Пельмешкина',
			publish: '1 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			education: 'факультет Юриспруденция, бакалавр',
			sex: 'Женский',
			date: '31.01.1995',
			country: 'Россия',
			phone: '+79991099910',
			expirence: 'Нет',
			languages: 'английский (средний уровень), немецкий (базовый уровень)',
			content: 'Длинный, очень длинный текст про то, какой наш соискатель ДАртьньян, и кто в этом мире все остальные. Как обычно - большая часть воды, остальное - наглейшая ложь, но все поверят, потому что остальные даже читать не умеют',
			fileResume: 'http://placehold.it/1000x600',
			shedule: 'Частичная',
			city: 'Багратионовск',
			email: 'pelmeshka@yandex.ru'
		},
		{
			id: 2,
			name: 'Иван',
			surname: 'Иванов',
			publish: '2 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			education: 'ПТУ №43',
			sex: 'Мужской',
			date: '17.12.1990',
			country: 'Россия',
			phone: '+79991099910',
			expirence: '10 лет',
			languages: 'английский (средний уровень), немецкий (базовый уровень)',
			content: 'Длинный, очень длинный текст про то, какой наш соискатель ДАртьньян, и кто в этом мире все остальные. Как обычно - большая часть воды, остальное - наглейшая ложь, но все поверят, потому что остальные даже читать не умеют',
			fileResume: 'http://placehold.it/1000x600',
			shedule: 'Полная',
			city: 'Калининград',
			email: 'pelmeshka@yandex.ru'
		},
		{
			id: 3,
			name: 'Курбангуллы',
			surname: 'Нурмагоммедов',
			publish: '3 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			education: 'АГУ, Академик всех академий',
			sex: 'Мужской',
			date: '4.08.1968',
			country: 'Туркмения',
			phone: '+79991099910',
			expirence: '45 лет',
			languages: 'английский (средний уровень), немецкий (базовый уровень)',
			content: 'Длинный, очень длинный текст про то, какой наш соискатель ДАртьньян, и кто в этом мире все остальные. Как обычно - большая часть воды, остальное - наглейшая ложь, но все поверят, потому что остальные даже читать не умеют',
			fileResume: 'http://placehold.it/1000x600',
			shedule: 'Частичная',
			city: 'Гусев',
			email: 'pelmeshka@yandex.ru'
		},
		{
			id: 4,
			name: 'Ниндзя',
			surname: 'Самурай',
			publish: '4 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			education: 'Школа жизни',
			sex: 'Мужской',
			date: '15.10.1078',
			country: 'Япония',
			phone: '+79991099910',
			expirence: 'Очень большой',
			languages: 'английский (средний уровень), немецкий (базовый уровень)',
			content: 'Длинный, очень длинный текст про то, какой наш соискатель ДАртьньян, и кто в этом мире все остальные. Как обычно - большая часть воды, остальное - наглейшая ложь, но все поверят, потому что остальные даже читать не умеют',
			fileResume: 'http://placehold.it/1000x600',
			shedule: 'Полная',
			city: 'Светлый',
			email: 'pelmeshka@yandex.ru'
		},
		{
			id: 5,
			name: 'Сергей',
			surname: 'Сергеев',
			publish: '5 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			education: 'Политехнический колледж города Орска, нефтегазовый промысел',
			sex: 'Мужской',
			date: '12.10.1994',
			country: 'Россия',
			phone: '+79991099910',
			expirence: 'Есть',
			languages: 'английский (средний уровень), немецкий (базовый уровень)',
			content: 'Длинный, очень длинный текст про то, какой наш соискатель ДАртьньян, и кто в этом мире все остальные. Как обычно - большая часть воды, остальное - наглейшая ложь, но все поверят, потому что остальные даже читать не умеют',
			fileResume: 'http://placehold.it/1000x600',
			shedule: 'Стажировка',
			city: 'Балтийск',
			email: 'pelmeshka@yandex.ru'
		},
		{
			id: 6,
			name: 'Наталья',
			surname: 'Давиденко',
			publish: '6 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			education: '-',
			sex: 'Женский',
			date: '9.09.1994',
			country: 'Россия',
			phone: '+79991099910',
			expirence: '4 года',
			languages: 'английский (средний уровень), немецкий (базовый уровень)',
			content: 'Длинный, очень длинный текст про то, какой наш соискатель ДАртьньян, и кто в этом мире все остальные. Как обычно - большая часть воды, остальное - наглейшая ложь, но все поверят, потому что остальные даже читать не умеют',
			fileResume: 'http://placehold.it/1000x600',
			shedule: 'Полная',
			city: 'Нестеров',
			email: 'pelmeshka@yandex.ru'
		},
		{
			id: 7,
			name: 'Конь',
			surname: 'Педальный',
			publish: '7 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			education: 'есть',
			sex: 'Мужской',
			date: '6.12.2005',
			country: 'Казахстан',
			phone: '+79991099910',
			expirence: 'Я конь!',
			languages: 'английский (средний уровень), немецкий (базовый уровень)',
			content: 'Длинный, очень длинный текст про то, какой наш соискатель ДАртьньян, и кто в этом мире все остальные. Как обычно - большая часть воды, остальное - наглейшая ложь, но все поверят, потому что остальные даже читать не умеют',
			fileResume: 'http://placehold.it/1000x600',
			shedule: 'Частичная',
			city: 'Калининград',
			email: 'pelmeshka@yandex.ru'
		},
		{
			id: 8,
			name: 'Зайнаб',
			surname: 'Махаева',
			publish: '8 апреля 2019',
			thumb: 'http://placehold.it/1000x600',
			education: 'Махачкалинское музыкальное училище №91',
			sex: 'Женский',
			date: '17.03.1986',
			country: 'Азербайджан',
			phone: '+79991099910',
			expirence: '19 лет',
			languages: 'английский (средний уровень), немецкий (базовый уровень)',
			content: 'Длинный, очень длинный текст про то, какой наш соискатель ДАртьньян, и кто в этом мире все остальные. Как обычно - большая часть воды, остальное - наглейшая ложь, но все поверят, потому что остальные даже читать не умеют',
			fileResume: 'http://placehold.it/1000x600',
			shedule: 'Частичная',
			city: 'Гусев',
			email: 'pelmeshka@yandex.ru'
		}
		]
	},
	mutations: {

	},
	actions: {

	},
	getters: {
		resumes (state) {
			return state.resumes
		},
		resumeById (state) {
			return resumeId => {
				return state.resumes.find(resume => resume.id === +resumeId)
			}
		}
	}
}
